{
  "version": "1.0",
  "truncation": {
    "direction": "Left",
    "max_length": 124,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 124
    },
    "direction": "Right",
    "pad_to_multiple_of": 1,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 41,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 42,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 43,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 44,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 45,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "OMOP_AGE": 0,
      "OMOP_BIRTH": 1,
      "OMOP_ENROLLMENT": 2,
      "OMOP_RACE": 3,
      "OMOP_SEX": 4,
      "ENC_INPATIENT": 5,
      "LOINC:2093-3": 6,
      "LOINC:3094-0": 7,
      "LOINC:2089-1": 8,
      "LOINC:2823-3": 9,
      "LOINC:2160-0": 10,
      "LOINC:2339-0": 11,
      "LOINC:2085-9": 12,
      "LOINC:4548-4": 13,
      "LOINC:2571-8": 14,
      "LOINC:2951-2": 15,
      "ICD10:M54": 16,
      "ICD10:I63": 17,
      "ICD10:I50": 18,
      "ICD10:N18": 19,
      "ICD10:F32": 20,
      "ICD10:I21": 21,
      "ICD10:C34": 22,
      "ICD10:J44": 23,
      "ICD10:I10": 24,
      "ICD10:E11": 25,
      "RxNorm:N06AB06": 26,
      "RxNorm:C08CA01": 27,
      "RxNorm:R03BB04": 28,
      "RxNorm:M01AE01": 29,
      "RxNorm:C03CA01": 30,
      "RxNorm:A02BC01": 31,
      "RxNorm:R03AC02": 32,
      "RxNorm:N05BA06": 33,
      "RxNorm:N02BE01": 34,
      "RxNorm:A10BA02": 35,
      "RxNorm:B01AC06": 36,
      "RxNorm:C09CA03": 37,
      "RxNorm:C09AA02": 38,
      "RxNorm:C07AB07": 39,
      "RxNorm:C10AA01": 40
    },
    "unk_token": "[UNK]"
  }
}