{
  "architectures": [
    "MTLForSurvival"
  ],
  "batch_norm": true,
  "bias": true,
  "freeze_transformer": false,
  "hidden_dropout_prob": 0.05,
  "hidden_size": 16,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7"
  },
  "initializer": "kaiming_normal",
  "initializer_range": 0.02,
  "intermediate_size": 16,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2,
    "LABEL_3": 3,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7
  },
  "loss": {},
  "loss_weight": 1.0,
  "metric_train_sample_size": 5000,
  "model_type": "mtl",
  "mtl_balance_params": {},
  "mtl_balance_strategy": null,
  "num_events": 1,
  "num_features": 10,
  "num_hidden_layers": 0,
  "pretrained_params": {
    "config": {
      "_attn_implementation_autoset": false,
      "_attn_implementation_internal": null,
      "_commit_hash": null,
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "attention_probs_dropout_prob": 0.05,
      "bad_words_ids": null,
      "begin_suppress_tokens": null,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "classifier_dropout": null,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": null,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "hidden_act": "gelu",
      "hidden_dropout_prob": 0.05,
      "hidden_size": 16,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "initializer_range": 0.01,
      "intermediate_size": 64,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "layer_norm_eps": 1e-12,
      "length_penalty": 1.0,
      "max_length": 20,
      "max_position_embeddings": 512,
      "min_length": 0,
      "no_repeat_ngram_size": 0,
      "num_attention_heads": 2,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_hidden_layers": 2,
      "num_return_sequences": 1,
      "output_attentions": false,
      "output_hidden_states": true,
      "output_scores": false,
      "pad_token_id": 0,
      "position_embedding_type": "absolute",
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "sep_token_id": null,
      "suppress_tokens": null,
      "task_specific_params": null,
      "temperature": 1.0,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torch_dtype": null,
      "torchscript": false,
      "transformers_version": null,
      "type_vocab_size": 2,
      "typical_p": 1.0,
      "use_bfloat16": false,
      "use_cache": true,
      "vocab_size": 30522
    }
  },
  "select_hidden_layers": null,
  "sentence_emb": 3,
  "task_heads": [
    {
      "_attn_implementation_autoset": false,
      "_attn_implementation_internal": null,
      "_commit_hash": null,
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "bad_words_ids": null,
      "batch_norm": false,
      "begin_suppress_tokens": null,
      "bias": true,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "diversity_penalty": 0.0,
      "do_sample": false,
      "duration_cuts": [],
      "early_stopping": false,
      "encoder_no_repeat_ngram_size": 0,
      "eos_token_id": null,
      "exponential_decay_length_penalty": null,
      "finetuning_task": null,
      "forced_bos_token_id": null,
      "forced_eos_token_id": null,
      "freeze_transformer": false,
      "hidden_dropout_prob": false,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1",
        "2": "LABEL_2",
        "3": "LABEL_3"
      },
      "indiv_intermediate_size": 24,
      "indiv_num_hidden_layers": 1,
      "initializer": "kaiming_normal",
      "initializer_range": 0.02,
      "intermediate_size": 4,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1,
        "LABEL_2": 2,
        "LABEL_3": 3
      },
      "length_penalty": 1.0,
      "loss": {
        "survival": {
          "_target_": "sat.loss.SATNLLPCHazardLoss",
          "importance_sample_weights": "./data/model-hub/metabric/imp_sample.csv",
          "num_events": 1
        }
      },
      "loss_weight": 1.0,
      "max_length": 20,
      "max_time": 400,
      "metric_train_sample_size": 5000,
      "min_length": 0,
      "no_repeat_ngram_size": 0,
      "num_beam_groups": 1,
      "num_beams": 1,
      "num_events": 1,
      "num_features": 8,
      "num_hidden_layers": 0,
      "num_inputs": 32,
      "num_return_sequences": 1,
      "output_attentions": false,
      "output_hidden_states": false,
      "output_scores": false,
      "pad_token_id": null,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "remove_invalid_values": false,
      "repetition_penalty": 1.0,
      "return_dict": true,
      "return_dict_in_generate": false,
      "sep_token_id": null,
      "suppress_tokens": null,
      "task_specific_params": {},
      "temperature": 1.0,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "top_k": 50,
      "top_p": 1.0,
      "torch_dtype": null,
      "torchscript": false,
      "transformers_version": null,
      "typical_p": 1.0,
      "use_bfloat16": false
    }
  ],
  "task_specific_params": {},
  "token_emb": 5,
  "torch_dtype": "float32",
  "transformers_version": "4.50.0"
}
