{
  "version": "1.0",
  "truncation": {
    "direction": "Left",
    "max_length": 10,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 10
    },
    "direction": "Right",
    "pad_to_multiple_of": 1,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 58,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 59,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 60,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 61,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 62,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "x6_4": 0,
      "x7_7": 1,
      "x4_1": 2,
      "x5_3": 3,
      "x5_2": 4,
      "x4_0": 5,
      "x7_6": 6,
      "x6_5": 7,
      "x0_0.0": 8,
      "x0_3.0": 9,
      "x0_6.0": 10,
      "x0_9.0": 11,
      "x1_0.0": 12,
      "x1_3.0": 13,
      "x1_6.0": 14,
      "x1_9.0": 15,
      "x2_0.0": 16,
      "x2_3.0": 17,
      "x2_6.0": 18,
      "x2_9.0": 19,
      "x3_0.0": 20,
      "x3_3.0": 21,
      "x3_6.0": 22,
      "x3_9.0": 23,
      "x8_0.0": 24,
      "x8_3.0": 25,
      "x8_6.0": 26,
      "x8_8.0": 27,
      "x8_9.0": 28,
      "x0_1.0": 29,
      "x0_2.0": 30,
      "x0_4.0": 31,
      "x0_5.0": 32,
      "x0_7.0": 33,
      "x0_8.0": 34,
      "x1_1.0": 35,
      "x1_2.0": 36,
      "x1_4.0": 37,
      "x1_5.0": 38,
      "x1_7.0": 39,
      "x1_8.0": 40,
      "x2_1.0": 41,
      "x2_2.0": 42,
      "x2_4.0": 43,
      "x2_5.0": 44,
      "x2_7.0": 45,
      "x2_8.0": 46,
      "x3_1.0": 47,
      "x3_2.0": 48,
      "x3_4.0": 49,
      "x3_5.0": 50,
      "x3_7.0": 51,
      "x3_8.0": 52,
      "x8_1.0": 53,
      "x8_2.0": 54,
      "x8_4.0": 55,
      "x8_5.0": 56,
      "x8_7.0": 57
    },
    "unk_token": "[UNK]"
  }
}