{
  "version": "1.0",
  "truncation": {
    "direction": "Left",
    "max_length": 10,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 10
    },
    "direction": "Right",
    "pad_to_multiple_of": 1,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 13,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 14,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 15,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 16,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 17,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "x0": 0,
      "x1": 1,
      "x2": 2,
      "x3": 3,
      "x8": 4,
      "x6_0.0": 5,
      "x7_1.0": 6,
      "x4_1.0": 7,
      "x5_1.0": 8,
      "x5_0.0": 9,
      "x4_0.0": 10,
      "x7_0.0": 11,
      "x6_1.0": 12
    },
    "unk_token": "[UNK]"
  }
}